Terraform will perform the following actions:

  # module.aws.aws_ssm_parameter.main_group["CHAT_WORKFLOW_SID"] must be replaced
-/+ resource "aws_ssm_parameter" "main_group" {
      ~ arn            = "arn:aws:ssm:us-east-1:712893914485:parameter/PROD_TWILIO_HU_CHAT_WORKFLOW_SID" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ description    = "Twilio account - Chat transfer workflow SID" -> (known after apply)
      ~ id             = "PROD_TWILIO_HU_CHAT_WORKFLOW_SID" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "PROD_TWILIO_HU_CHAT_WORKFLOW_SID" # forces replacement -> (known after apply) # forces replacement
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["POST_SURVEY_BOT_CHAT_URL"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
        id             = "PROD_TWILIO_HU_POST_SURVEY_BOT_CHAT_URL"
      + insecure_value = (known after apply)
        name           = (sensitive value)
        tags           = {}
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["SURVEY_WORKFLOW_SID"] must be replaced
-/+ resource "aws_ssm_parameter" "main_group" {
      ~ arn            = "arn:aws:ssm:us-east-1:712893914485:parameter/PROD_TWILIO_HU_SURVEY_WORKFLOW_SID" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ description    = "Twilio account - Survey Workflow SID" -> (known after apply)
      ~ id             = "PROD_TWILIO_HU_SURVEY_WORKFLOW_SID" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "PROD_TWILIO_HU_SURVEY_WORKFLOW_SID" # forces replacement -> (known after apply) # forces replacement
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_chat_workflow_sid will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_chat_workflow_sid" {
        id             = "/production/twilio/AC378f491732fc29691b4126a2287cea9a/chat_workflow_sid"
      + insecure_value = (known after apply)
        name           = "/production/twilio/AC378f491732fc29691b4126a2287cea9a/chat_workflow_sid"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/twilio/AC378f491732fc29691b4126a2287cea9a/chat_workflow_sid"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_post_survey_bot_chat_url[0] will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_post_survey_bot_chat_url" {
        id             = "/production/twilio/AC378f491732fc29691b4126a2287cea9a/post_survey_bot_chat_url"
      + insecure_value = (known after apply)
        name           = "/production/twilio/AC378f491732fc29691b4126a2287cea9a/post_survey_bot_chat_url"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/twilio/AC378f491732fc29691b4126a2287cea9a/post_survey_bot_chat_url"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_survey_workflow_sid will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_survey_workflow_sid" {
        id             = "/production/twilio/AC378f491732fc29691b4126a2287cea9a/survey_workflow_sid"
      + insecure_value = (known after apply)
        name           = "/production/twilio/AC378f491732fc29691b4126a2287cea9a/survey_workflow_sid"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/twilio/AC378f491732fc29691b4126a2287cea9a/survey_workflow_sid"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws_monitoring.aws_cloudwatch_metric_alarm.alarm_twilio_email will be destroyed
  # (because aws_cloudwatch_metric_alarm.alarm_twilio_email is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "alarm_twilio_email" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:us-east-1:712893914485:AWS-production-alarms",
        ] -> null
      - alarm_description         = "Kék Vonal (Production) received at least 1 Twilio errors in the past hour. Sent email notification." -> null
      - alarm_name                = "production-twilio-reporter-hu-email" -> null
      - arn                       = "arn:aws:cloudwatch:us-east-1:712893914485:alarm:production-twilio-reporter-hu-email" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 1 -> null
      - dimensions                = {
          - "Name"  = "Account"
          - "Value" = "HU_PRODUCTION"
        } -> null
      - evaluation_periods        = 1 -> null
      - id                        = "production-twilio-reporter-hu-email" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "PRODUCTION ERROR x ACCOUNT" -> null
      - namespace                 = "Twilio Reporter" -> null
      - ok_actions                = [] -> null
      - period                    = 3600 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 1 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # module.channel.twilio_flex_flex_flows_v1.channel_flow["webchat"] will be updated in-place
  ~ resource "twilio_flex_flex_flows_v1" "channel_flow" {
      ~ friendly_name           = "Flex Web Channel Flow" -> "Flex Webchat Flow"
        id                      = "FO3fe954827eb10fa9a9b907f5e5be9ae4"
      ~ janitor_enabled         = false -> true
        # (8 unchanged attributes hidden)
    }

  # module.channel.twilio_studio_flows_v2.channel_studio_flow["voice"] will be updated in-place
  ~ resource "twilio_studio_flows_v2" "channel_studio_flow" {
      ~ definition     = jsonencode(
            {
              - description   = "IVR for creating a Flex voice task"
              - flags         = {
                  - allow_concurrent_calls = true
                }
              - initial_state = "Trigger"
              - states        = [
                  - {
                      - name        = "Trigger"
                      - properties  = {
                          - offset = {
                              - x = 40
                              - y = -380
                            }
                        }
                      - transitions = [
                          - {
                              - event = "incomingMessage"
                            },
                          - {
                              - event = "incomingCall"
                              - next  = "operating_hours"
                            },
                          - {
                              - event = "incomingConversationMessage"
                            },
                          - {
                              - event = "incomingRequest"
                            },
                          - {
                              - event = "incomingParent"
                            },
                        ]
                      - type        = "trigger"
                    },
                  - {
                      - name        = "Poland"
                      - properties  = {
                          - attributes = jsonencode(
                                {
                                  - channelType        = "voice"
                                  - helpline           = "International Ukrainian Helpline"
                                  - ignoreAgent        = ""
                                  - phone              = "{{trigger.call.To}}"
                                  - transferTargetType = ""
                                  - type               = "inbound"
                                }
                            )
                          - channel    = "TCfb919f30d890da192c95070faf8ddd18"
                          - offset     = {
                              - x = -80
                              - y = 730
                            }
                          - workflow   = "WW5814cf7617d435faf2103e8bdb3fba52"
                        }
                      - transitions = [
                          - {
                              - event = "callComplete"
                            },
                          - {
                              - event = "failedToEnqueue"
                            },
                          - {
                              - event = "callFailure"
                            },
                        ]
                      - type        = "send-to-flex"
                    },
                  - {
                      - name        = "Romania"
                      - properties  = {
                          - attributes = jsonencode(
                                {
                                  - channelType        = "voice"
                                  - helpline           = "International Ukrainian Helpline"
                                  - ignoreAgent        = ""
                                  - phone              = "{{trigger.call.To}}"
                                  - transferTargetType = ""
                                  - type               = "inbound"
                                }
                            )
                          - channel    = "TCfb919f30d890da192c95070faf8ddd18"
                          - offset     = {
                              - x = 310
                              - y = 730
                            }
                          - workflow   = "WW5814cf7617d435faf2103e8bdb3fba52"
                        }
                      - transitions = [
                          - {
                              - event = "callComplete"
                            },
                          - {
                              - event = "failedToEnqueue"
                            },
                          - {
                              - event = "callFailure"
                            },
                        ]
                      - type        = "send-to-flex"
                    },
                  - {
                      - name        = "Hungary"
                      - properties  = {
                          - attributes    = jsonencode(
                                {
                                  - channelType        = "voice"
                                  - helpline           = "Kek Vonal"
                                  - ignoreAgent        = ""
                                  - phone              = "{{trigger.call.To}}"
                                  - transferTargetType = ""
                                  - type               = "inbound"
                                }
                            )
                          - channel       = "TCfaa9f228ef808c7ab9f1ec5c047f8947"
                          - offset        = {
                              - x = 560
                              - y = 1240
                            }
                          - waitUrl       = ""
                          - waitUrlMethod = "GET"
                          - workflow      = "WW75a5ba514d56e07635517d335b8f8dce"
                        }
                      - transitions = [
                          - {
                              - event = "callComplete"
                            },
                          - {
                              - event = "failedToEnqueue"
                            },
                          - {
                              - event = "callFailure"
                            },
                        ]
                      - type        = "send-to-flex"
                    },
                  - {
                      - name        = "split_by_phoneNumber"
                      - properties  = {
                          - input  = "{{trigger.call.To}}"
                          - offset = {
                              - x = -470
                              - y = 380
                            }
                        }
                      - transitions = [
                          - {
                              - event = "noMatch"
                            },
                          - {
                              - conditions = [
                                  - {
                                      - arguments     = [
                                          - "{{trigger.call.To}}",
                                        ]
                                      - friendly_name = "If value contains +48800012935"
                                      - type          = "contains"
                                      - value         = "+48800012935"
                                    },
                                ]
                              - event      = "match"
                              - next       = "Poland"
                            },
                          - {
                              - conditions = [
                                  - {
                                      - arguments     = [
                                          - "{{trigger.call.To}}",
                                        ]
                                      - friendly_name = "If value contains +40800476029"
                                      - type          = "contains"
                                      - value         = "+18445890458"
                                    },
                                ]
                              - event      = "match"
                              - next       = "Romania"
                            },
                          - {
                              - conditions = [
                                  - {
                                      - arguments     = [
                                          - "{{trigger.call.To}}",
                                        ]
                                      - friendly_name = "If value contains +3680984590"
                                      - type          = "contains"
                                      - value         = "+3680984590"
                                    },
                                ]
                              - event      = "match"
                              - next       = "Hungary"
                            },
                        ]
                      - type        = "split-based-on"
                    },
                  - {
                      - name        = "engagement"
                      - properties  = {
                          - environment_sid = "ZE2ae6219e757f93a730c5b095a3d2f8d5"
                          - function_sid    = "ZH2ebce6cbec579b3a40ca30d9386b1d22"
                          - offset          = {
                              - x = 420
                              - y = 200
                            }
                          - service_sid     = "ZSf3cffcef8a24637d9f46c60b4c106b83"
                          - url             = "https://kek-vonal-service-7245.twil.io/engagement"
                        }
                      - transitions = [
                          - {
                              - event = "success"
                              - next  = "eligible_workers"
                            },
                          - {
                              - event = "fail"
                            },
                        ]
                      - type        = "run-function"
                    },
                  - {
                      - name        = "queue_assigned"
                      - properties  = {
                          - input  = "{{widgets.engagement.parsed.tasks_by_status.assigned}}"
                          - offset = {
                              - x = 960
                              - y = 320
                            }
                        }
                      - transitions = [
                          - {
                              - event = "noMatch"
                              - next  = "QueueFull"
                            },
                          - {
                              - conditions = [
                                  - {
                                      - arguments     = [
                                          - "{{widgets.engagement.parsed.tasks_by_status.assigned}}",
                                        ]
                                      - friendly_name = "If value equal_to 0"
                                      - type          = "less_than"
                                      - value         = "2"
                                    },
                                ]
                              - event      = "match"
                              - next       = "queue_wrapping"
                            },
                        ]
                      - type        = "split-based-on"
                    },
                  - {
                      - name        = "QueueFull"
                      - properties  = {
                          - language = "ru-RU"
                          - loop     = 1
                          - offset   = {
                              - x = 1230
                              - y = 1130
                            }
                          - play     = "https://kek-vonal-service-7245.twil.io/ukrainian_busy.mp3"
                          - voice    = "Polly.Tatyana"
                        }
                      - transitions = [
                          - {
                              - event = "audioComplete"
                            },
                        ]
                      - type        = "say-play"
                    },
                  - {
                      - name        = "WelcomeMsg"
                      - properties  = {
                          - language = "ru-RU"
                          - loop     = 1
                          - offset   = {
                              - x = 690
                              - y = 940
                            }
                          - play     = "https://kek-vonal-service-7245.twil.io/welcome.mp3"
                          - voice    = "Polly.Tatyana"
                        }
                      - transitions = [
                          - {
                              - event = "audioComplete"
                              - next  = "Hungary"
                            },
                        ]
                      - type        = "say-play"
                    },
                  - {
                      - name        = "queue_wrapping"
                      - properties  = {
                          - input  = "{{widgets.engagement.parsed.tasks_by_status.wrapping}}"
                          - offset = {
                              - x = 1330
                              - y = 400
                            }
                        }
                      - transitions = [
                          - {
                              - event = "noMatch"
                              - next  = "QueueFull"
                            },
                          - {
                              - conditions = [
                                  - {
                                      - arguments     = [
                                          - "{{widgets.engagement.parsed.tasks_by_status.wrapping}}",
                                        ]
                                      - friendly_name = "If value equal_to 0"
                                      - type          = "less_than"
                                      - value         = "2"
                                    },
                                ]
                              - event      = "match"
                              - next       = "queue_reserved"
                            },
                        ]
                      - type        = "split-based-on"
                    },
                  - {
                      - name        = "queue_reserved"
                      - properties  = {
                          - input  = "{{widgets.engagement.parsed.tasks_by_status.reserved}}"
                          - offset = {
                              - x = 1780
                              - y = 420
                            }
                        }
                      - transitions = [
                          - {
                              - event = "noMatch"
                              - next  = "QueueFull"
                            },
                          - {
                              - conditions = [
                                  - {
                                      - arguments     = [
                                          - "{{widgets.engagement.parsed.tasks_by_status.reserved}}",
                                        ]
                                      - friendly_name = "If value equal_to 0"
                                      - type          = "less_than"
                                      - value         = "2"
                                    },
                                ]
                              - event      = "match"
                              - next       = "WelcomeMsg"
                            },
                        ]
                      - type        = "split-based-on"
                    },
                  - {
                      - name        = "operating_hours"
                      - properties  = {
                          - environment_sid = "ZE1c1ec4cb1c326f6cdd33d69a713ccc74"
                          - function_sid    = "ZH2e902feddaccba9632510ff4ac889628"
                          - offset          = {
                              - x = 250
                              - y = -180
                            }
                          - parameters      = [
                              - {
                                  - key   = "channel"
                                  - value = "voice"
                                },
                            ]
                          - service_sid     = "ZS87806dcc63d06994f4a3f9f38450ebdf"
                          - url             = "https://serverless-9220-production.twil.io/operatingHours"
                        }
                      - transitions = [
                          - {
                              - event = "success"
                              - next  = "engagement"
                            },
                          - {
                              - event = "fail"
                            },
                        ]
                      - type        = "run-function"
                    },
                  - {
                      - name        = "check_hours"
                      - properties  = {
                          - input  = "{{widgets.operating_hours.body}}"
                          - offset = {
                              - x = 830
                              - y = -120
                            }
                        }
                      - transitions = [
                          - {
                              - event = "noMatch"
                            },
                          - {
                              - conditions = [
                                  - {
                                      - arguments     = [
                                          - "{{widgets.operating_hours.body}}",
                                        ]
                                      - friendly_name = "If value equal_to open"
                                      - type          = "equal_to"
                                      - value         = "\"open\""
                                    },
                                ]
                              - event      = "match"
                              - next       = "engagement"
                            },
                          - {
                              - conditions = [
                                  - {
                                      - arguments     = [
                                          - "{{widgets.operating_hours.body}}",
                                        ]
                                      - friendly_name = "If value equal_to closed"
                                      - type          = "equal_to"
                                      - value         = "\"closed\""
                                    },
                                ]
                              - event      = "match"
                              - next       = "closed"
                            },
                        ]
                      - type        = "split-based-on"
                    },
                  - {
                      - name        = "closed"
                      - properties  = {
                          - language = "ru-RU"
                          - loop     = 1
                          - offset   = {
                              - x = 1390
                              - y = 100
                            }
                          - play     = "https://kek-vonal-service-7245.twil.io/ukrainian_closed.mp3"
                          - voice    = "Polly.Tatyana"
                        }
                      - transitions = [
                          - {
                              - event = "audioComplete"
                            },
                        ]
                      - type        = "say-play"
                    },
                  - {
                      - name        = "eligible_workers"
                      - properties  = {
                          - input  = "{{widgets.engagement.parsed.total_available_workers}}"
                          - offset = {
                              - x = 400
                              - y = 420
                            }
                        }
                      - transitions = [
                          - {
                              - event = "noMatch"
                              - next  = "queue_assigned"
                            },
                          - {
                              - conditions = [
                                  - {
                                      - arguments     = [
                                          - "{{widgets.engagement.parsed.total_available_workers}}",
                                        ]
                                      - friendly_name = "If value equal_to 0"
                                      - type          = "equal_to"
                                      - value         = "{{widgets.engagement.parsed.tasks_by_status.assigned}}"
                                    },
                                ]
                              - event      = "match"
                              - next       = "QueueFull"
                            },
                          - {
                              - conditions = [
                                  - {
                                      - arguments     = [
                                          - "{{widgets.engagement.parsed.total_available_workers}}",
                                        ]
                                      - friendly_name = "If value not_equal_to 0"
                                      - type          = "not_equal_to"
                                      - value         = "{{widgets.engagement.parsed.tasks_by_status.assigned}}"
                                    },
                                ]
                              - event      = "match"
                              - next       = "WelcomeMsg"
                            },
                        ]
                      - type        = "split-based-on"
                    },
                ]
            }
        ) -> (known after apply)
      ~ friendly_name  = "Voice IVR" -> "Voice Studio Flow"
        id             = "FW85c6dbd71e7b040611dca695df4f815c"
        # (3 unchanged attributes hidden)
    }

  # module.channel.twilio_studio_flows_v2.channel_studio_flow["webchat"] will be updated in-place
  ~ resource "twilio_studio_flows_v2" "channel_studio_flow" {
      ~ definition     = jsonencode(
            {
              - description   = "Messaging Flow - Lex"
              - flags         = {
                  - allow_concurrent_calls = true
                }
              - initial_state = "Trigger"
              - states        = [
                  - {
                      - name        = "Trigger"
                      - properties  = {
                          - offset = {
                              - x = -40
                              - y = -260
                            }
                        }
                      - transitions = [
                          - {
                              - event = "incomingMessage"
                              - next  = "split_language"
                            },
                          - {
                              - event = "incomingCall"
                            },
                          - {
                              - event = "incomingConversationMessage"
                            },
                          - {
                              - event = "incomingRequest"
                            },
                          - {
                              - event = "incomingParent"
                            },
                        ]
                      - type        = "trigger"
                    },
                  - {
                      - name        = "split_language"
                      - properties  = {
                          - input  = "{{trigger.message.ChannelAttributes.pre_engagement_data.language}}"
                          - offset = {
                              - x = -50
                              - y = 130
                            }
                        }
                      - transitions = [
                          - {
                              - event = "noMatch"
                            },
                          - {
                              - conditions = [
                                  - {
                                      - arguments     = [
                                          - "{{trigger.message.ChannelAttributes.pre_engagement_data.language}}",
                                        ]
                                      - friendly_name = "If value equal_to hu-HU"
                                      - type          = "equal_to"
                                      - value         = "hu-HU"
                                    },
                                ]
                              - event      = "match"
                            },
                          - {
                              - conditions = [
                                  - {
                                      - arguments     = [
                                          - "{{trigger.message.ChannelAttributes.pre_engagement_data.language}}",
                                        ]
                                      - friendly_name = "If value equal_to ru-HU"
                                      - type          = "equal_to"
                                      - value         = "ru-HU"
                                    },
                                ]
                              - event      = "match"
                              - next       = "pre_survey_complete_ru"
                            },
                          - {
                              - conditions = [
                                  - {
                                      - arguments     = [
                                          - "{{trigger.message.ChannelAttributes.pre_engagement_data.language}}",
                                        ]
                                      - friendly_name = "If value equal_to ukr-HU"
                                      - type          = "equal_to"
                                      - value         = "ukr-HU"
                                    },
                                ]
                              - event      = "match"
                              - next       = "pre_survey_complete_ukr"
                            },
                        ]
                      - type        = "split-based-on"
                    },
                  - {
                      - name        = "webAttributesRU"
                      - properties  = {
                          - attributes = <<-EOT
                                {"language":"{{trigger.message.ChannelAttributes.pre_engagement_data.language}}", "ip":"{{trigger.message.ChannelAttributes.pre_engagement_data.ip}}","name": "{{trigger.message.ChannelAttributes.from}}", "channelType": "{{trigger.message.ChannelAttributes.channel_type}}", "channelSid": "{{trigger.message.ChannelSid}}", "helpline": "Kék Vona}", "ignoreAgent":"", "transferTargetType":"",
                                "preEngagementData": {{trigger.message.ChannelAttributes.pre_engagement_data | to_json}},
                                "memory": {{trigger.message.ChannelAttributes.memory | to_json}}}
                            EOT
                          - channel    = "TCe545d865ac4d5eaae0542290325b458c"
                          - offset     = {
                              - x = 390
                              - y = 1260
                            }
                          - workflow   = "WW75a5ba514d56e07635517d335b8f8dce"
                        }
                      - transitions = [
                          - {
                              - event = "callComplete"
                            },
                          - {
                              - event = "failedToEnqueue"
                            },
                          - {
                              - event = "callFailure"
                            },
                        ]
                      - type        = "send-to-flex"
                    },
                  - {
                      - name        = "webAttributesUKR"
                      - properties  = {
                          - attributes = <<-EOT
                                {"language":"{{trigger.message.ChannelAttributes.pre_engagement_data.language}}", "ip":"{{trigger.message.ChannelAttributes.pre_engagement_data.ip}}","name": "{{trigger.message.ChannelAttributes.from}}", "channelType": "{{trigger.message.ChannelAttributes.channel_type}}", "channelSid": "{{trigger.message.ChannelSid}}", "helpline": "Kék Vona}", "ignoreAgent":"", "transferTargetType":"",
                                "preEngagementData": {{trigger.message.ChannelAttributes.pre_engagement_data | to_json}},
                                "memory": {{trigger.message.ChannelAttributes.memory | to_json}}}
                            EOT
                          - channel    = "TCe545d865ac4d5eaae0542290325b458c"
                          - offset     = {
                              - x = 940
                              - y = 1250
                            }
                          - workflow   = "WW75a5ba514d56e07635517d335b8f8dce"
                        }
                      - transitions = [
                          - {
                              - event = "callComplete"
                            },
                          - {
                              - event = "failedToEnqueue"
                            },
                          - {
                              - event = "callFailure"
                            },
                        ]
                      - type        = "send-to-flex"
                    },
                  - {
                      - name        = "pre_survey_complete_ukr"
                      - properties  = {
                          - input  = "{{trigger.message.ChannelAttributes.preSurveyComplete}}"
                          - offset = {
                              - x = 680
                              - y = 330
                            }
                        }
                      - transitions = [
                          - {
                              - event = "noMatch"
                              - next  = "capture_channel_with_bot_ukr"
                            },
                          - {
                              - conditions = [
                                  - {
                                      - arguments     = [
                                          - "{{trigger.message.ChannelAttributes.preSurveyComplete}}",
                                        ]
                                      - friendly_name = "If value equal_to true"
                                      - type          = "equal_to"
                                      - value         = "true"
                                    },
                                ]
                              - event      = "match"
                              - next       = "webAttributesUKR"
                            },
                        ]
                      - type        = "split-based-on"
                    },
                  - {
                      - name        = "capture_channel_with_bot_ukr"
                      - properties  = {
                          - environment_sid = "ZE1c1ec4cb1c326f6cdd33d69a713ccc74"
                          - function_sid    = "ZHd97278ad2b96ffbc537706847f6ee926"
                          - offset          = {
                              - x = 1140
                              - y = 720
                            }
                          - parameters      = [
                              - {
                                  - key   = "channelSid"
                                  - value = "{{flow.channel.address}}"
                                },
                              - {
                                  - key   = "message"
                                  - value = "trigger_pre_survey"
                                },
                              - {
                                  - key   = "studioFlowSid"
                                  - value = "{{flow.flow_sid}}"
                                },
                              - {
                                  - key   = "language"
                                  - value = "uk"
                                },
                              - {
                                  - key   = "botSuffix"
                                  - value = "pre_survey"
                                },
                              - {
                                  - key   = "triggerType"
                                  - value = "withUserMessage"
                                },
                              - {
                                  - key   = "releaseType"
                                  - value = "triggerStudioFlow"
                                },
                              - {
                                  - key   = "releaseFlag"
                                  - value = "preSurveyComplete"
                                },
                            ]
                          - service_sid     = "ZS87806dcc63d06994f4a3f9f38450ebdf"
                          - url             = "https://serverless-9220-production.twil.io/channelCapture/captureChannelWithBot"
                        }
                      - transitions = [
                          - {
                              - event = "success"
                            },
                          - {
                              - event = "fail"
                            },
                        ]
                      - type        = "run-function"
                    },
                  - {
                      - name        = "pre_survey_complete_ru"
                      - properties  = {
                          - input  = "{{trigger.message.ChannelAttributes.preSurveyComplete}}"
                          - offset = {
                              - x = 30
                              - y = 420
                            }
                        }
                      - transitions = [
                          - {
                              - event = "noMatch"
                              - next  = "capture_channel_with_bot_ru"
                            },
                          - {
                              - conditions = [
                                  - {
                                      - arguments     = [
                                          - "{{trigger.message.ChannelAttributes.preSurveyComplete}}",
                                        ]
                                      - friendly_name = "If value equal_to true"
                                      - type          = "equal_to"
                                      - value         = "true"
                                    },
                                ]
                              - event      = "match"
                              - next       = "webAttributesRU"
                            },
                        ]
                      - type        = "split-based-on"
                    },
                  - {
                      - name        = "capture_channel_with_bot_ru"
                      - properties  = {
                          - environment_sid = "ZE1c1ec4cb1c326f6cdd33d69a713ccc74"
                          - function_sid    = "ZHd97278ad2b96ffbc537706847f6ee926"
                          - offset          = {
                              - x = -130
                              - y = 680
                            }
                          - parameters      = [
                              - {
                                  - key   = "channelSid"
                                  - value = "{{flow.channel.address}}"
                                },
                              - {
                                  - key   = "message"
                                  - value = "trigger_pre_survey"
                                },
                              - {
                                  - key   = "studioFlowSid"
                                  - value = "{{flow.flow_sid}}"
                                },
                              - {
                                  - key   = "language"
                                  - value = "ru"
                                },
                              - {
                                  - key   = "botSuffix"
                                  - value = "pre_survey"
                                },
                              - {
                                  - key   = "triggerType"
                                  - value = "withUserMessage"
                                },
                              - {
                                  - key   = "releaseType"
                                  - value = "triggerStudioFlow"
                                },
                              - {
                                  - key   = "releaseFlag"
                                  - value = "preSurveyComplete"
                                },
                            ]
                          - service_sid     = "ZS87806dcc63d06994f4a3f9f38450ebdf"
                          - url             = "https://serverless-9220-production.twil.io/channelCapture/captureChannelWithBot"
                        }
                      - transitions = [
                          - {
                              - event = "success"
                            },
                          - {
                              - event = "fail"
                            },
                        ]
                      - type        = "run-function"
                    },
                ]
            }
        ) -> (known after apply)
      ~ friendly_name  = "Messaging Flow" -> "Webchat Studio Flow"
        id             = "FWff2ba1849dc9a8665e8e885e1773fcfe"
        # (3 unchanged attributes hidden)
    }

  # module.flex.twilio_flex_flex_flows_v1.messaging_flow will be destroyed
  # (because twilio_flex_flex_flows_v1.messaging_flow is not in configuration)
  - resource "twilio_flex_flex_flows_v1" "messaging_flow" {
      - channel_type            = "sms" -> null
      - chat_service_sid        = "ISdca2150e42bb4423acc764453e5c889f" -> null
      - contact_identity        = "+12014821989" -> null
      - enabled                 = true -> null
      - friendly_name           = "Flex Messaging Channel Flow" -> null
      - id                      = "FO8862dfcaad3b6789d9ba47a16dd2c30b" -> null
      - integration_flow_sid    = "FWff2ba1849dc9a8665e8e885e1773fcfe" -> null
      - integration_retry_count = 3 -> null
      - integration_type        = "studio" -> null
      - janitor_enabled         = false -> null
      - long_lived              = false -> null
      - sid                     = "FO8862dfcaad3b6789d9ba47a16dd2c30b" -> null
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.chat has moved to module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.task_channel["chat"]
    resource "twilio_taskrouter_workspaces_task_channels_v1" "task_channel" {
        id                        = "WSa1a17e196f9645dfbb3df42139f93ef9/TCe545d865ac4d5eaae0542290325b458c"
        # (5 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.default has moved to module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.task_channel["default"]
    resource "twilio_taskrouter_workspaces_task_channels_v1" "task_channel" {
        id                        = "WSa1a17e196f9645dfbb3df42139f93ef9/TCa1dc964889aac7a80a3027281de0536d"
        # (5 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.email has moved to module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.task_channel["email"]
    resource "twilio_taskrouter_workspaces_task_channels_v1" "task_channel" {
        id                        = "WSa1a17e196f9645dfbb3df42139f93ef9/TC4b3c60e06cc7964554b25dca57cd9e82"
        # (5 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.sms has moved to module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.task_channel["sms"]
    resource "twilio_taskrouter_workspaces_task_channels_v1" "task_channel" {
        id                        = "WSa1a17e196f9645dfbb3df42139f93ef9/TC02ffd62e006ef6ef18656e63e6507166"
        # (5 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.video has moved to module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.task_channel["video"]
    resource "twilio_taskrouter_workspaces_task_channels_v1" "task_channel" {
        id                        = "WSa1a17e196f9645dfbb3df42139f93ef9/TC87b8c08da76717dba504b433e76d6e6f"
        # (5 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.voice has moved to module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.task_channel["voice"]
    resource "twilio_taskrouter_workspaces_task_channels_v1" "task_channel" {
        id                        = "WSa1a17e196f9645dfbb3df42139f93ef9/TCfaa9f228ef808c7ab9f1ec5c047f8947"
        # (5 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_queues_v1.task_queue["e2e_test"] will be created
  + resource "twilio_taskrouter_workspaces_task_queues_v1" "task_queue" {
      + assignment_activity_sid  = (known after apply)
      + friendly_name            = "E2E Test Queue"
      + id                       = (known after apply)
      + max_reserved_workers     = (known after apply)
      + reservation_activity_sid = (known after apply)
      + sid                      = (known after apply)
      + target_workers           = "email=='aselo-alerts+production@techmatters.org'"
      + task_order               = (known after apply)
      + workspace_sid            = "WSa1a17e196f9645dfbb3df42139f93ef9"
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_queues_v1.helpline_queue has moved to module.taskRouter.twilio_taskrouter_workspaces_task_queues_v1.task_queue["master"]
    resource "twilio_taskrouter_workspaces_task_queues_v1" "task_queue" {
        id                   = "WSa1a17e196f9645dfbb3df42139f93ef9/WQ77639ebb906c4643eb0fbc05fa1fc774"
        # (6 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["master"] will be updated in-place
  # (moved from module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.master_workflow)
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode(
            {
              - task_routing = {
                  - default_filter = {
                      - queue = "WQ77639ebb906c4643eb0fbc05fa1fc774"
                    }
                  - filters        = [
                      - {
                          - expression           = "phone=='+3680984590' OR phone=='+12014821989' OR channelType=='web' OR isContactlessTask==true"
                          - filter_friendly_name = "Kék Vonal"
                          - targets              = [
                              - {
                                  - expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  - queue      = "WQ77639ebb906c4643eb0fbc05fa1fc774"
                                },
                            ]
                        },
                    ]
                }
            }
        ) -> (known after apply)
        id                       = "WSa1a17e196f9645dfbb3df42139f93ef9/WW75a5ba514d56e07635517d335b8f8dce"
        # (4 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["survey"] will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode(
          ~ {
              ~ task_routing = {
                  ~ filters = [
                      - {
                          - expression           = "isSurveyTask==true"
                          - filter_friendly_name = "Survey Filter"
                          - targets              = [
                              - {
                                  - expression = "isSurveyTask==true"
                                  - queue      = "WQcfc40087d8d1b717612f20bb6b2855b2"
                                },
                            ]
                        },
                        {
                            expression           = "isChatCaptureControl==true"
                            filter_friendly_name = "CaptureChannel"
                            targets              = [
                                {
                                    queue = "WQcfc40087d8d1b717612f20bb6b2855b2"
                                },
                            ]
                        },
                    ]
                }
            }
        )
      ~ friendly_name            = "Survey" -> "Survey Workflow"
        id                       = "WSa1a17e196f9645dfbb3df42139f93ef9/WWb02a75e925e33e7fd1dccf9df5604150"
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 9 to change, 4 to destroy.